UFO/sim/decks/cfd_disc/case/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;     // verb-4 analyze §1.1: RANS k-omega SST
    turbulence      on;
    printCoeffs     on;
}
// ************************************************************************* //
